quest_system_798656124_name=^?^Treaty with the Dwarves
quest_system_798656124_stage_0=^?^Proceed through the Creiston Mines to Kordar.
quest_system_798656124_stage_1=^?^Go to Ardan's Peaks, and find there the dwarven capital, Taron. Negotiate a truce with the king.
quest_system_798656124_stage_2=^?^Convince the dwarves that your intentions are sincere. Go down into the mines and free Castle Bogacho for the crown Prince Tibold.
quest_system_798656124_stage_3=^?^Sign the peace treaty with Torn Digor.
quest_system_798656124_stage_4=^?^Return home to Kronberg with the signed treaty.
quest_system_798656124_stage_5=^?^Tell King Torn Digor that the crown Prince Tibold is free.
quest_system_798656124_task=^?^Apologize to the dwarven king, Torn Digor. If you free the Creiston Mines for him, you should be able to convince the dwarf to make a new treaty.<br>[reward]
